rheoTool/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/BMP/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;
        
    }

    "(theta|tau|C|A|Phi)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-10;
        relTol            0.;
        minIter           0;
        maxIter           1000;
    }
 
}
 
 
SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
         
    }
}

relaxationFactors
{
     
}

// ************************************************************************* //
